In [1]:
import pandas as pd

pd.DataFrame({
    "Name": ["Nikhil"],
    "File Type": [".ipynb"],
    "Status": ["Correct setup ✅"]
})

     Name File Type           Status
0  Nikhil    .ipynb  Correct setup ✅

In [2]:
import pandas as pd

data = {
    "Name" : ["Amit", "Rishi", "Nikhil", "Navya", "Santhosh"],
    "Maths": [78,81,92,91,95],
    "Science": [91,92,87,89,91],
    "English": [74,88,86,80,89]
}

df = pd.DataFrame(data)
df

       Name  Maths  Science  English
0      Amit     78       91       74
1     Rishi     81       92       88
2    Nikhil     92       87       86
3     Navya     91       89       80
4  Santhosh     95       91       89

In [3]:
df["Total"] = df["Maths"] + df["Science"] + df["English"]
df["Average"] = df["Total"] / 3
df

       Name  Maths  Science  English  Total    Average
0      Amit     78       91       74    243  81.000000
1     Rishi     81       92       88    261  87.000000
2    Nikhil     92       87       86    265  88.333333
3     Navya     91       89       80    260  86.666667
4  Santhosh     95       91       89    275  91.666667

In [5]:
df.loc[df["Total"].idxmax()]

Name        Santhosh
Maths             95
Science           91
English           89
Total            275
Average    91.666667
Name: 4, dtype: object

In [6]:
df[df["Average"] > 85]

       Name  Maths  Science  English  Total    Average
1     Rishi     81       92       88    261  87.000000
2    Nikhil     92       87       86    265  88.333333
3     Navya     91       89       80    260  86.666667
4  Santhosh     95       91       89    275  91.666667

In [7]:
df[["Maths", "Science", "English"]].describe()

           Maths  Science    English
count   5.000000      5.0   5.000000
mean   87.400000     90.0  83.400000
std     7.436397      2.0   6.308724
min    78.000000     87.0  74.000000
25%    81.000000     89.0  80.000000
50%    91.000000     91.0  86.000000
75%    92.000000     91.0  88.000000
max    95.000000     92.0  89.000000

In [8]:
df.sort_values(by= "Total", ascending=False)

       Name  Maths  Science  English  Total    Average
4  Santhosh     95       91       89    275  91.666667
2    Nikhil     92       87       86    265  88.333333
1     Rishi     81       92       88    261  87.000000
3     Navya     91       89       80    260  86.666667
0      Amit     78       91       74    243  81.000000

In [9]:
df["Rank"] = df["Total"].rank(ascending=False)
df.sort_values("Rank")

       Name  Maths  Science  English  Total    Average  Rank
4  Santhosh     95       91       89    275  91.666667   1.0
2    Nikhil     92       87       86    265  88.333333   2.0
1     Rishi     81       92       88    261  87.000000   3.0
3     Navya     91       89       80    260  86.666667   4.0
0      Amit     78       91       74    243  81.000000   5.0

In [10]:
df["Result"] = df["Average"].apply(
    lambda x: "Pass" if x >= 85 else "Fail"
)
df

       Name  Maths  Science  English  Total    Average  Rank Result
0      Amit     78       91       74    243  81.000000   5.0   Fail
1     Rishi     81       92       88    261  87.000000   3.0   Pass
2    Nikhil     92       87       86    265  88.333333   2.0   Pass
3     Navya     91       89       80    260  86.666667   4.0   Pass
4  Santhosh     95       91       89    275  91.666667   1.0   Pass

In [12]:
print(df.loc[df["Maths"].idxmax(),["Name", "Maths"]])
print(df.loc[df["Science"].idxmax(),["Name", "Science"]])
print(df.loc[df["English"].idxmax(),["Name", "English"]])

Name     Santhosh
Maths          95
Name: 4, dtype: object
Name       Rishi
Science       92
Name: 1, dtype: object
Name       Santhosh
English          89
Name: 4, dtype: object

In [14]:
df.to_csv("student_report.csv", index=False)